---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.ContainsKey(Autodesk.Revit.DB.ExportLayerKey)
source: html/9f8e8a59-e7bf-dc32-428e-f8d2a8fad7b1.htm
---
# Autodesk.Revit.DB.ExportLayerTable.ContainsKey Method

Checks whether a layer key exists in the table.

## Syntax (C#)
```csharp
public bool ContainsKey(
	ExportLayerKey exportlayerKey
)
```

## Parameters
- **exportlayerKey** (`Autodesk.Revit.DB.ExportLayerKey`) - The export layer Key.

## Returns
True if the layer key exists in the table.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null